# pandas note -5

# Row and column manipulation

In [1]:
import pandas as pd

In [2]:
people = {
    "first" : ["priyanshu","anirudh","naresh"],
    "last" : ["verma","kudhwah","kumar"],
    "email" : ["priyanshukumar984@gmail.com","anirudh@gmail.com","naresh@gmail.com"]
}

In [4]:
df =  pd.DataFrame(people)

In [5]:
df

       first     last                        email
0  priyanshu    verma  priyanshukumar984@gmail.com
1    anirudh  kudhwah            anirudh@gmail.com
2     naresh    kumar             naresh@gmail.com

In [6]:
df.columns

Index(['first', 'last', 'email'], dtype='object')

In [10]:
#updating name of column
df.columns = ['first_name','last_name','email']

In [9]:
df

  first_name last_name                        email
0  priyanshu     verma  priyanshukumar984@gmail.com
1    anirudh   kudhwah            anirudh@gmail.com
2     naresh     kumar             naresh@gmail.com

In [11]:
# if we want to change the name of specific column

df.rename(columns = {'first_name' : 'first', 'last_name' : 'last'})

       first     last                        email
0  priyanshu    verma  priyanshukumar984@gmail.com
1    anirudh  kudhwah            anirudh@gmail.com
2     naresh    kumar             naresh@gmail.com

### this does not change the origional data

In [12]:
df

  first_name last_name                        email
0  priyanshu     verma  priyanshukumar984@gmail.com
1    anirudh   kudhwah            anirudh@gmail.com
2     naresh     kumar             naresh@gmail.com

In [14]:
df.rename(columns = {'first_name': 'first','last_name': 'last','email':'email'}, inplace = True)

In [15]:
df

       first     last                        email
0  priyanshu    verma  priyanshukumar984@gmail.com
1    anirudh  kudhwah            anirudh@gmail.com
2     naresh    kumar             naresh@gmail.com

In [16]:
df.loc[2]

first              naresh
last                kumar
email    naresh@gmail.com
Name: 2, dtype: object

In [17]:
# if i want to update the row value
df.loc[2] = ['rahul','singh','rahul@gmail.com']

In [18]:
df

       first     last                        email
0  priyanshu    verma  priyanshukumar984@gmail.com
1    anirudh  kudhwah            anirudh@gmail.com
2      rahul    singh              rahul@gmail.com

In [19]:
# if i want to update specific value of row
df.loc[2, 'email'] = 'rahulSingh@gmail.com'

In [20]:
df

       first     last                        email
0  priyanshu    verma  priyanshukumar984@gmail.com
1    anirudh  kudhwah            anirudh@gmail.com
2      rahul    singh         rahulSingh@gmail.com

In [21]:
# if i want to update multiple values of specific row
df.loc[2,['last','email']] = ['kumar','rahulS@gmail.com']

In [22]:
df

       first     last                        email
0  priyanshu    verma  priyanshukumar984@gmail.com
1    anirudh  kudhwah            anirudh@gmail.com
2      rahul    kumar             rahulS@gmail.com

# Insertion to and deletion from DataFrame

In [23]:
# Concatenation
df['first'] + " "+df['last']

0    priyanshu verma
1    anirudh kudhwah
2        rahul kumar
dtype: object

In [24]:
# Add new column
df['fullname'] = df['first'] + " "+df['last']

In [25]:
df

       first     last                        email         fullname
0  priyanshu    verma  priyanshukumar984@gmail.com  priyanshu verma
1    anirudh  kudhwah            anirudh@gmail.com  anirudh kudhwah
2      rahul    kumar             rahulS@gmail.com      rahul kumar

In [27]:
# lets remove a column
df.drop(columns = ['first','last'])

                         email         fullname
0  priyanshukumar984@gmail.com  priyanshu verma
1            anirudh@gmail.com  anirudh kudhwah
2             rahulS@gmail.com      rahul kumar

In [28]:
df

       first     last                        email         fullname
0  priyanshu    verma  priyanshukumar984@gmail.com  priyanshu verma
1    anirudh  kudhwah            anirudh@gmail.com  anirudh kudhwah
2      rahul    kumar             rahulS@gmail.com      rahul kumar

In [29]:
# lets split the fullname
df['fullname'].str.split(' ')

0    [priyanshu, verma]
1    [anirudh, kudhwah]
2        [rahul, kumar]
Name: fullname, dtype: object

In [30]:
# Returning as a dataFrame after spliting
df['fullname'].str.split(' ',expand = True)

           0        1
0  priyanshu    verma
1    anirudh  kudhwah
2      rahul    kumar

In [31]:
# lets assign this data frame columns in our dataFrame
df[['first','last']] = df['fullname'].str.split(' ',expand = True)

In [32]:
df

       first     last                        email         fullname
0  priyanshu    verma  priyanshukumar984@gmail.com  priyanshu verma
1    anirudh  kudhwah            anirudh@gmail.com  anirudh kudhwah
2      rahul    kumar             rahulS@gmail.com      rahul kumar

In [34]:
df.drop(columns = 'fullname')

       first     last                        email
0  priyanshu    verma  priyanshukumar984@gmail.com
1    anirudh  kudhwah            anirudh@gmail.com
2      rahul    kumar             rahulS@gmail.com

In [35]:
df

       first     last                        email         fullname
0  priyanshu    verma  priyanshukumar984@gmail.com  priyanshu verma
1    anirudh  kudhwah            anirudh@gmail.com  anirudh kudhwah
2      rahul    kumar             rahulS@gmail.com      rahul kumar

In [36]:
df.drop(columns = 'fullname',inplace = True)

In [37]:
df

       first     last                        email
0  priyanshu    verma  priyanshukumar984@gmail.com
1    anirudh  kudhwah            anirudh@gmail.com
2      rahul    kumar             rahulS@gmail.com

## Adding rows

In [46]:
df.append({'first': 'Umesh'}, ignore_index=True)

AttributeError: 'DataFrame' object has no attribute 'append'

In [47]:
df

       first     last                        email
0  priyanshu    verma  priyanshukumar984@gmail.com
1    anirudh  kudhwah            anirudh@gmail.com
2      rahul    kumar             rahulS@gmail.com

In [48]:
# deleting row from DataFrame
df.drop(index= 2 ,inplace = True)

In [49]:
df

       first     last                        email
0  priyanshu    verma  priyanshukumar984@gmail.com
1    anirudh  kudhwah            anirudh@gmail.com